modm-ext/data.modm.io/docs/svd/header_stm32wle5xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SYSCFG</name>
      <description>System configuration controller</description>
      <baseAddress>0x40010000</baseAddress>
      <registers>
        <register>
          <name>MEMRMP</name>
          <description>SYSCFG memory remap register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MEM_MODE</name>
              <description>SYSCFG_Memory Remap Config</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLASH</name>
                  <description>Main Flash memory mapped at 0x00000000</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSTEMFLASH</name>
                  <description>System Flash memory mapped at 0x00000000</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM</name>
                  <description>SRAM1 mapped at 0x00000000</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR1</name>
          <description>SYSCFG configuration register 1</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BOOSTEN</name>
              <description>I/O analog switch voltage booster enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C_PB6_FMP</name>
              <description>Fast-mode Plus (Fm+) driving capability activation on PB6</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C_PB7_FMP</name>
              <description>Fast-mode Plus (Fm+) driving capability activation on PB7</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C_PB8_FMP</name>
              <description>Fast-mode Plus (Fm+) driving capability activation on PB8</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C_PB9_FMP</name>
              <description>Fast-mode Plus (Fm+) driving capability activation on PB9</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C1_FMP</name>
              <description>I2C1 Fast-mode Plus (Fm+) driving capability activation</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C2_FMP</name>
              <description>I2C2 Fast-mode Plus (Fm+) driving capability activation</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C3_FMP</name>
              <description>I2C3 Fast-mode Plus (Fm+) driving capability activation</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTICR1</name>
          <description>SYSCFG external interrupt configuration registers</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EXTI0</name>
              <description>External Interrupt Line 0 configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>EXTI1</name>
              <description>External Interrupt Line 1 configuration</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>EXTI2</name>
              <description>External Interrupt Line 2 configuration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>EXTI3</name>
              <description>External Interrupt Line 3 configuration</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTICR2</name>
          <description>SYSCFG external interrupt configuration registers</description>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EXTI4</name>
              <description>External Interrupt Line 4 configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>EXTI5</name>
              <description>External Interrupt Line 5 configuration</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>EXTI6</name>
              <description>External Interrupt Line 6 configuration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>EXTI7</name>
              <description>External Interrupt Line 7 configuration</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTICR3</name>
          <description>SYSCFG external interrupt configuration registers</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EXTI8</name>
              <description>External Interrupt Line 8 configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>EXTI9</name>
              <description>External Interrupt Line 9 configuration</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>EXTI10</name>
              <description>External Interrupt Line 10 configuration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>EXTI11</name>
              <description>External Interrupt Line 11 configuration</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTICR4</name>
          <description>SYSCFG external interrupt configuration registers</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EXTI12</name>
              <description>External Interrupt Line 12 configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>EXTI13</name>
              <description>External Interrupt Line 13 configuration</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>EXTI14</name>
              <description>External Interrupt Line 14 configuration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>EXTI15</name>
              <description>External Interrupt Line 15 configuration</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SCSR</name>
          <description>SYSCFG SRAM2 control and status register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SRAM2ER</name>
              <description>SRAM2 Erase</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAMBSY</name>
              <description>SRAM2 and SRAM1 busy by erase operation</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PKASRAMBSY</name>
              <description>PKA SRAM busy by erase operation</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR2</name>
          <description>SYSCFG configuration register 2</description>
          <addressOffset>0x1c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CLL</name>
              <description>Cortex M4 LOCKUP (hardfault) output enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPL</name>
              <description>SRAM2 Parity Lock</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PVDL</name>
              <description>PVD Lock</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ECCL</name>
              <description>ECC Lock</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPF</name>
              <description>SRAM2 Parity Lock</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SWPR</name>
          <description>SYSCFG SRAM2 write protection register part</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PAGE0</name>
              <description>SRAM2 Write protection page 0 (0x20008000 - 0x200083FF)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE1</name>
              <description>SRAM2 Write protection page 1 (0x20008400 - 0x200087FF)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE2</name>
              <description>SRAM2 Write protection page 2 (0x20008800 - 0x20008BFF)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE3</name>
              <description>SRAM2 Write protection page 3 (0x20008C00 - 0x20008FFF)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE4</name>
              <description>SRAM2 Write protection page 4 (0x20009000 - 0x200093FF)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE5</name>
              <description>SRAM2 Write protection page 5 (0x20009400 - 0x200097FF)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE6</name>
              <description>SRAM2 Write protection page 6 (0x20009800 - 0x20009BFF)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE7</name>
              <description>SRAM2 Write protection page 7 (0x20009C00 - 0x20009FFF)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE8</name>
              <description>SRAM2 Write protection page 8 (0x2000A000 - 0x2000A3FF)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE9</name>
              <description>SRAM2 Write protection page 9 (0x2000A400 - 0x2000A7FF)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE10</name>
              <description>SRAM2 Write protection page 10 (0x2000A800 - 0x2000ABFF)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE11</name>
              <description>SRAM2 Write protection page 11 (0x2000AC00 - 0x2000AFFF)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE12</name>
              <description>SRAM2 Write protection page 12 (0x2000B000 - 0x2000B3FF)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE13</name>
              <description>SRAM2 Write protection page 13 (0x2000B400 - 0x2000B7FF)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE14</name>
              <description>SRAM2 Write protection page 14 (0x2000B800 - 0x2000BBFF)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE15</name>
              <description>SRAM2 Write protection page 15 (0x2000BC00 - 0x2000BFFF)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE16</name>
              <description>SRAM2 Write protection page 16 (0x2000C000 - 0x2000C3FF)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE17</name>
              <description>SRAM2 Write protection page 17 (0x2000C400 - 0x2000C7FF)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE18</name>
              <description>SRAM2 Write protection page 18 (0x2000C800 - 0x2000CBFF)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE19</name>
              <description>SRAM2 Write protection page 19 (0x2000CC00 - 0x2000CFFF)</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE20</name>
              <description>SRAM2 Write protection page 20 (0x2000D000 - 0x2000D3FF)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE21</name>
              <description>SRAM2 Write protection page 21 (0x2000D400 - 0x2000D7FF)</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE22</name>
              <description>SRAM2 Write protection page 22 (0x2000D800 - 0x2000DBFF)</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE23</name>
              <description>SRAM2 Write protection page 23 (0x2000DC00 - 0x2000DFFF)</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE24</name>
              <description>SRAM2 Write protection page 24 (0x2000E000 - 0x2000E3FF)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE25</name>
              <description>SRAM2 Write protection page 25 (0x2000E400 - 0x2000E7FF)</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE26</name>
              <description>SRAM2 Write protection page 26 (0x2000E800 - 0x2000EBFF)</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE27</name>
              <description>SRAM2 Write protection page 27 (0x2000EC00 - 0x2000EFFF)</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE28</name>
              <description>SRAM2 Write protection page 28 (0x2000F000 - 0x2000F3FF)</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE29</name>
              <description>SRAM2 Write protection page 29 (0x2000F400 - 0x2000F7FF)</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE30</name>
              <description>SRAM2 Write protection page 30 (0x2000F800 - 0x2000FBFF)</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE31</name>
              <description>SRAM2 Write protection page 31 (0x2000FC00 - 0x2000FFFF)</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SKR</name>
          <description>SYSCFG SRAM2 key register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>KEY</name>
              <description>SRAM2 write protection key for software erase</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RFDCR</name>
          <description>SYSCFG CPU2 radio debug control register</description>
          <addressOffset>0x208</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RFTBSEL</name>
              <description>Radio debug test bus selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ANALOG_TEST_BUS</name>
                  <description>Analog test bus selected on RF_ADTB[3:0]</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIGITAL_TEST_BUS</name>
                  <description>Digital test bus selected on RF_ADTB[3:0]</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
